In [1]:
people = {
    "first_name":["Duyen le","ahihi","NaN"],
    "last_name":"huu",
    "sdt":["0123","1234","3456"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

  first_name last_name   sdt
0   Duyen le       huu  0123
1      ahihi       huu  1234
2        NaN       huu  3456

In [5]:
df.sdt

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [6]:
df['sdt']

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [7]:
df[['sdt','first_name']]

    sdt first_name
0  0123   Duyen le
1  1234      ahihi
2  3456        NaN

In [8]:
df.columns

Index(['first_name', 'last_name', 'sdt'], dtype='object')

In [9]:
df.iloc[[0,1],2]

0    0123
1    1234
Name: sdt, dtype: object

In [10]:
df

  first_name last_name   sdt
0   Duyen le       huu  0123
1      ahihi       huu  1234
2        NaN       huu  3456

In [11]:
df.loc[[0,2],"sdt"]

0    0123
2    3456
Name: sdt, dtype: object

In [12]:
df.set_index('sdt')

     first_name last_name
sdt
0123   Duyen le       huu
1234      ahihi       huu
3456        NaN       huu